---
kind: property
id: P:Autodesk.Revit.UI.Events.CanExecuteEventArgs.CanExecute
source: html/266330c6-b6ce-7a82-7026-e688f04351d6.htm
---
# Autodesk.Revit.UI.Events.CanExecuteEventArgs.CanExecute Property

The value that indicates whether the Command associated with this event can be executed.

## Syntax (C#)
```csharp
public bool CanExecute { get; set; }
```